vertical-pod-autoscaler/experiments/sn-pbr-throughput/14/user.log
Running 15m test @ http://10.109.170.205:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 28.069ms, rate sampling interval: 84ms
  Thread calibration: mean lat.: 25.160ms, rate sampling interval: 76ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.33s    13.12s   34.80s    77.05%
    Req/Sec    14.55     13.37    53.00     57.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  204.03ms
 75.000%  616.96ms
 90.000%   31.56s 
 99.000%   34.80s 
 99.900%   36.70s 
 99.990%   37.22s 
 99.999%   37.49s 
100.000%   37.49s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.125     0.000000            1         1.00
      43.263     0.100000         2632         1.11
      69.695     0.200000         5266         1.25
     105.983     0.300000         7889         1.43
     149.375     0.400000        10522         1.67
     204.031     0.500000        13143         2.00
     238.975     0.550000        14460         2.22
     282.623     0.600000        15778         2.50
     338.431     0.650000        17089         2.86
     423.935     0.700000        18406         3.33
     616.959     0.750000        19715         4.00
   27574.271     0.775000        20375         4.44
   29065.215     0.800000        21036         5.00
   29917.183     0.825000        21692         5.71
   30539.775     0.850000        22364         6.67
   31031.295     0.875000        23003         8.00
   31277.055     0.887500        23338         8.89
   31555.583     0.900000        23660        10.00
   31817.727     0.912500        23993        11.43
   32129.023     0.925000        24336        13.33
   32440.319     0.937500        24658        16.00
   32604.159     0.943750        24816        17.78
   32784.383     0.950000        24980        20.00
   32964.607     0.956250        25139        22.86
   33177.599     0.962500        25303        26.67
   33439.743     0.968750        25471        32.00
   33619.967     0.971875        25547        35.56
   33816.575     0.975000        25637        40.00
   33980.415     0.978125        25713        45.71
   34177.023     0.981250        25804        53.33
   34373.631     0.984375        25882        64.00
   34471.935     0.985938        25932        71.11
   34537.471     0.987500        25963        80.00
   34701.311     0.989062        25999        91.43
   34832.383     0.990625        26044       106.67
   34963.455     0.992188        26082       128.00
   35061.759     0.992969        26107       142.22
   35160.063     0.993750        26125       160.00
   35291.135     0.994531        26144       182.86
   35487.743     0.995313        26163       213.33
   35749.887     0.996094        26184       256.00
   35880.959     0.996484        26194       284.44
   36077.567     0.996875        26205       320.00
   36208.639     0.997266        26216       365.71
   36306.943     0.997656        26230       426.67
   36405.247     0.998047        26237       512.00
   36438.015     0.998242        26241       568.89
   36536.319     0.998437        26245       640.00
   36634.623     0.998633        26251       731.43
   36700.159     0.998828        26261       853.33
   36700.159     0.999023        26261      1024.00
   36732.927     0.999121        26263      1137.78
   36798.463     0.999219        26266      1280.00
   36831.231     0.999316        26270      1462.86
   36863.999     0.999414        26272      1706.67
   36929.535     0.999512        26274      2048.00
   36995.071     0.999561        26275      2275.56
   37060.607     0.999609        26279      2560.00
   37060.607     0.999658        26279      2925.71
   37060.607     0.999707        26279      3413.33
   37093.375     0.999756        26280      4096.00
   37158.911     0.999780        26282      4551.11
   37158.911     0.999805        26282      5120.00
   37158.911     0.999829        26282      5851.43
   37224.447     0.999854        26283      6826.67
   37224.447     0.999878        26283      8192.00
   37355.519     0.999890        26284      9102.22
   37355.519     0.999902        26284     10240.00
   37355.519     0.999915        26284     11702.86
   37388.287     0.999927        26285     13653.33
   37388.287     0.999939        26285     16384.00
   37388.287     0.999945        26285     18204.44
   37388.287     0.999951        26285     20480.00
   37388.287     0.999957        26285     23405.71
   37486.591     0.999963        26286     27306.67
   37486.591     1.000000        26286          inf
#[Mean    =     7332.006, StdDeviation   =    13119.253]
#[Max     =    37453.824, Total count    =        26286]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  26613 requests in 15.00m, 347.65MB read
  Socket errors: connect 0, read 0, write 8, timeout 0
Requests/sec:     29.57
Transfer/sec:    395.53KB